#знаходження факторіала за допомогою рекрсії
#факторіал 5 = 1*2*3*4*5, але також ми бачимо що факторіал 5, має в собі значення факторіалу 4, помноженого на число 5
#в свою чергу факторіл 4 = 1*2*3*4, має значення факторіалу 3, помноженого на 4
#факторіал 3 = 1*2*3, має значення факторіалу 2, помноженого на 3
#а факторіал 2 = 1*2, буде мати значення факторіалу 1 помноженого на 2
#ну і факторіал 1 = 1
#n! = (n-1)! * n
#тобто ми можемо знайти одну задачу, вирішенням декількох малих
def factorial(x):
	if x==1:#якщо значення факторіалу = 1, ми виходимо з ф-ї
		return 1
	return factorial(x-1)*x#а якщо ні, то ми з х віднімаємо 1, і множимо на х

print(factorial(4))